#include <iostream>
#include <windows.h>
using namespace std;

int main()
{
        //Це для того щоб символи коректно відображалися в командному вікні
	SetConsoleOutputCP(1251);
	SetConsoleCP(1251);
        
        //зміна sum для перевірки відповіді
	int sum;
         
        // виведення повідомлення в командне вікно
	cout << "Áóäü ëàñêà ðîçâ`ÿæ³òü ð³âíÿíÿ íèùå \n" "13+19=?\n" "Â³äïîâ³äü: \n";
        //Запрос відповіді на приклад
	cin >> sum;
	
        //через if else перевірка на правильність відповіді
		if (sum == 32)
		{
                        //результат при вірній відповіді
			cout << "Ïðàâèëüíî! Òàê òðèìàòè!\n";
		}

		else
		{
                         // результат при невірній відповіді
			cout << "Íåâ³ðíî ! Áóäü óâàæí³øå!\n";
		}
	


}
